nczy520/sample_project_ch9434/sdkconfig.defaults
# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"

# Use USB Serial/JTAG for console output (built-in USB on ESP32-S3 dev boards)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# Disable the legacy UART console so the on-board USB port is used
CONFIG_ESP_CONSOLE_NONE=n

# Lower log noise from boot
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---------- CH9434 driver defaults ----------
CONFIG_CH9434_SPI_HOST=2
CONFIG_CH9434_PIN_MOSI=11
CONFIG_CH9434_PIN_MISO=13
CONFIG_CH9434_PIN_SCK=12
CONFIG_CH9434_PIN_CS=10
CONFIG_CH9434_SPI_CLOCK_HZ=200000
CONFIG_CH9434_SPI_QUEUE_SIZE=16
CONFIG_CH9434_SPI_TASK_STACK=3072
CONFIG_CH9434_SPI_TASK_PRIO=10
CONFIG_CH9434_TX_CHUNK_SIZE=128
